test/testData.json

{
  "products": [{
    "name": "Christmas Box",
    "slug": "whisk-christmas-hamper",
    "available": true,
    "brand": "Whisk",
    "category": "Christmas",
    "description": "A Christmas Box",
    "momsRate": 12,
    "grossPrice": 39500,
    "deliveryMethods": [
      "delivery"
    ],
    "delivery": {
      "dates": [{
        "year": 2020,
        "month": 12,
        "date": 4,
        "time": { "start": "12:00", "end": "15:00" },
        "deadline": {
          "year": 2020,
          "month": 12,
          "date": 3,
          "hours": 10
        }
      }],
      "costs": {
        "0": {
          "zone": 0,
          "price": 0,
          "momsRate": 25
        },
        "1": {
          "zone": 1,
          "price": 4500,
          "momsRate": 25
        }
      },
      "maxZone": 2
    }
  }],
  "baskets": [{
    "items": [],
    "delivery": {
      "zone": -1,
      "address": ""
    }
  }, {
    "_id": "5faaab09669770905ac10e2f",
    "items": [{
      "deliveryType": "delivery",
      "deliveryDate": "2020-12-11-12:00-15:00",
      "productSlug": "whisk-christmas-hamper",
      "quantity": 1
    }, {
      "deliveryType": "delivery",
      "deliveryDate": "2020-12-18-12:00-15:00",
      "productSlug": "whisk-christmas-hamper",
      "quantity": 2
    }],
    "delivery": {
      "zone": 1,
      "address": "Sandhamnsgatan, Stockholm, Sweden"
    }
  }],
  "orders": [{
    "details": {
      "name": "ste",
      "email": "stebunting@gmail.com",
      "telephone": "07378978497324",
      "address":"Sehlstedtsgatan, 115 28 Stockholm, Sweden",
      "notes": ""
    },
    "delivery": [],
    "items": [
      {
        "productSlug": "whisk-christmas-hamper",
        "name" : "Whisk Christmas Hamper",
        "grossPrice": 45000,
        "momsRate": 12,
        "quantity": 2,
        "deliveryType" : "collection",
        "deliveryDate" : "2020-12-4-10:00-11:30"
      }
    ],
    "bottomLine": {
      "totalDelivery" : 0,
      "totalMoms": 4821,
      "totalPrice": 90000 },
    "payment": {
      "method": "swish",
      "status": "PAID",
      "refunds": [],
      "swish": {
        "id": "834AA1CE6D784D309CCB97D2D3EE7307"
      },
      "confirmationEmailSent": false
    }
  }, {
    "details" : {
      "name" : "ste",
      "email" : "stebunting@gmail.com",
      "telephone" : "07837897234",
      "notes": ""
    },
    "delivery" : [],
    "items" : [
      {
        "productId" : "5faafded3dcb1ac5af67870e",
        "name" : "Whisk Christmas Hamper",
        "grossPrice" : 45000,
        "momsRate" : 12,
        "quantity" : 2,
        "type" : "collection",
        "date" : "2020-12-4-10:00-11:30"
      }
    ],
    "bottomLine" : {
      "totalDelivery": 0,
      "totalMoms" : 4821,
      "totalPrice" : 90000
    },
    "payment" : {
      "method" : "swish",
      "swish" : {
        "id" : "F3630DCD06F247DE8E62A9E5927F4ACC"
      },
      "confirmationEmailSent": false
    }
  }],
  "swishPayments": [{
    "id": "834AA1CE6D784D309CCB97D2D3EE7307",
    "payeePaymentReference": null,
    "paymentReference": "29E594378FF14BE8A6ED87FEB786A773",
    "callbackUrl": "https://98a6a4df9949.ngrok.io/api/swishcallback",
    "payerAlias": "46733283460",
    "payeeAlias": "1230655860",
    "currency": "SEK",
    "message": "",
    "errorMessage": null,
    "status": "DECLINED",
    "amount": 900,
    "dateCreated": "2020-11-16T19:45:39.007Z",
    "datePaid": null,
    "errorCode": null
  }, {
    "id" : "F3630DCD06F247DE8E62A9E5927F4ACC",
    "payeePaymentReference" : null,
    "paymentReference" : "099A27F96D8C43A486C95A44545F483C",
    "callbackUrl" : "https://98a6a4df9949.ngrok.io/api/swishcallback",
    "payerAlias" : "46733283460",
    "payeeAlias" : "1230655860",
    "currency" : "SEK",
    "message" : "",
    "errorMessage" : null,
    "status" : "DECLINED",
    "amount" : 900,
    "dateCreated" : "2020-11-16T20:06:52.357Z",
    "datePaid" : null,
    "errorCode" : null
  }]
}
